function [ac,pre,re,ARI]=evaluateCluster(cluster,Ak,k)
%-----------------------------------------------------------------
%     输入：
%          cluster：原始类标签
%          Ak：聚类结果
%          k：类个数
%     输出：
%          ac：精度
%          pre：纯度
%          re：召回率
%          ARI：调整兰德指数
%------------------------------------------------------------------
Re=[cluster,Ak];
[n,p]=size(Re);
A1=Re(:,1)';
A2=Re(:,2)';
cp=zeros(k,k);
for i=1:k
    p1=find(A1==i);             %找到i个标签所对应的样本位置
    for j=1:k
      c1=find(A2==j);
      cp(i,j)=length(intersect(p1,c1));         % 找到两组样本交叉位置，并计算个数
    end
end
cp(k+1,:)=sum(cp);
cp(:,k+1)=sum(cp,2);
%for j=1:k
%    [a,b]=size(find(A1==j));
%    p(j)=a;
%end
%for j=1:k
%    [a,b]=size(find(A2==j));
%    c(j)=a;
%end
%-----------------------------------------------------------
for i=1:k  %计算精度
    a(i)=max(cp(i,1:k));              % 每一行的最大元素就是该类被识别正确的个数   
end
ac=sum(a)/n;
%---------------------------------------------------------------
%-----------------------------------------------
%计算ARI
cp1=cp(1:k,1:k);
r0=sum(sum((cp1.*(cp1-1))./2));
cp2=cp(1:k,1+k)';
r1=sum((cp2.*(cp2-1))./2);
cp3=cp(1+k,1:k);
r2=sum((cp3.*(cp3-1))./2);
r3=(2*r1*r2)/(n*(n-1));
ARI=(r0-r3)/(0.5*(r1+r2)-r3);
%--------------------------------------------
%---------------------------计算纯度,召回率
pre=(sum(max(cp(1:k,1:k),[],2)./cp(1:k,k+1)))/k;
re=(sum(max(cp(1:k,1:k))./cp(k+1,1:k)))/k;
disp(['聚类精度：',num2str(ac)]);
disp(['聚类纯度：',num2str(pre)]);
disp(['召回率：',num2str(re)]);
disp(['调整兰德指数：',num2str(ARI)]);
end